>>SOURCE FORMAT FREE

IDENTIFICATION DIVISION.
PROGRAM-ID. TEST02.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 NAME PIC X(20).
01 NAME-ID PIC 9(3).
01 AGE PIC 99.
01 DEPARTMENT PIC X(20).

PROCEDURE DIVISION.

    MOVE "PARVINDER" TO NAME.
    MOVE 19 TO AGE.
    MOVE 123 TO NAME-ID.
    MOVE "AI-ML" TO DEPARTMENT.

    DISPLAY "NAME: " NAME.
    DISPLAY "AGE: " AGE.
    DISPLAY "ID: " NAME-ID.
    DISPLAY "DEPARTMENT: " DEPARTMENT.

    STOP RUN.
    