       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOOP01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
            PERFORM 5 TIMES
               DISPLAY "HELLO"
            END-PERFORM.
            STOP RUN.
            